docs/physics/meta-physics.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Meta-Physics</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Meta-Physics</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-13ff4071-eac4-4c43-9ac0-8b03303e6f7c">1. Not What you think</a>
<ul>
<li><a href="#h-e3bde7ba-8b07-4d31-bb23-807910c1b080">1.1. Constructive Results</a></li>
<li><a href="#h-71531992-2a2e-4536-94bc-a9b8b8235ff6">1.2. Experimental Facts</a></li>
</ul>
</li>
<li><a href="#h-c4798587-9008-4c71-8147-718363036b61">2. Examples in Physics</a>
<ul>
<li><a href="#h-0280afcd-d10f-4d6f-ba80-eadca1f5187c">2.1. Methods for Solving Physics</a></li>
</ul>
</li>
<li><a href="#h-b10f11f4-db59-4585-abc4-1ea4a5feb224">3. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-13ff4071-eac4-4c43-9ac0-8b03303e6f7c" class="outline-2">
<h2 id="h-13ff4071-eac4-4c43-9ac0-8b03303e6f7c"><span class="section-number-2">1.</span> Not What you think</h2>
<div class="outline-text-2" id="text-h-13ff4071-eac4-4c43-9ac0-8b03303e6f7c">
<p>
This isn't about "New Age" hippy nonsense. By "Metaphysics", I mean
literally "about physics". As in, the conventions adopted to reason
about physics. For example, in presenting "experimental facts" in the
form of axioms, with the understanding their truth is provisional.
</p>

<p>
I present such things because I'm a mathematician writing a
<i>Zettelkasten</i>, and I cannot afford the luxury of space: an experiment's
results must be conveyed in a quarter of a slip of paper (roughly A6 in
size). When citing my <i>Zettelkasten</i> I summarize it as a particular
subclass of propositions.
</p>
</div>

<div id="outline-container-h-e3bde7ba-8b07-4d31-bb23-807910c1b080" class="outline-3">
<h3 id="h-e3bde7ba-8b07-4d31-bb23-807910c1b080"><span class="section-number-3">1.1.</span> Constructive Results</h3>
<div class="outline-text-3" id="text-h-e3bde7ba-8b07-4d31-bb23-807910c1b080">
<p>
When introducing, e.g., temperature, it's a new undefined term. We
measure it using a thermometer. Which just begs the question: what's a
thermometer? I tend to think providing an idealized construction from
what we have previously established works best.
</p>
</div>
</div>

<div id="outline-container-h-71531992-2a2e-4536-94bc-a9b8b8235ff6" class="outline-3">
<h3 id="h-71531992-2a2e-4536-94bc-a9b8b8235ff6"><span class="section-number-3">1.2.</span> Experimental Facts</h3>
<div class="outline-text-3" id="text-h-71531992-2a2e-4536-94bc-a9b8b8235ff6">
<p>
Some examples of experimental facts taken for granted:
</p>

<ul class="org-ul">
<li>The universe is described using 3 spatial dimensions and 1 temporal
dimension.</li>
<li>(Newton-Laplace Principle of Determinacy.) A physical system's
evolution is uniquely determined by its initial position and velocity.</li>
</ul>

<p>
Other experimental facts are really just worked examples. Experiments
(like the <a href="https://en.wikipedia.org/wiki/Cavendish_experiment">Cavendish experiment</a>, for example) constitutes a particular
<a href="http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.8.7115&amp;rep=rep1&amp;type=pdf">mathematical register</a> similar to what a mathematician
would call an "example". (Indeed, almost of physics amounts to a litany
of examples.)
</p>
</div>
</div>
</div>

<div id="outline-container-h-c4798587-9008-4c71-8147-718363036b61" class="outline-2">
<h2 id="h-c4798587-9008-4c71-8147-718363036b61"><span class="section-number-2">2.</span> Examples in Physics</h2>
<div class="outline-text-2" id="text-h-c4798587-9008-4c71-8147-718363036b61">
<p>
Unlike mathematics, "examples" in physics are not an instructive detour
but the constituents of the subject. Their importance is more akin to
that of theorems in mathematics. Picking good examples requires choosing
different physical situations, not different numeric values for the same
situation.
</p>
</div>

<div id="outline-container-h-0280afcd-d10f-4d6f-ba80-eadca1f5187c" class="outline-3">
<h3 id="h-0280afcd-d10f-4d6f-ba80-eadca1f5187c"><span class="section-number-3">2.1.</span> Methods for Solving Physics</h3>
<div class="outline-text-3" id="text-h-0280afcd-d10f-4d6f-ba80-eadca1f5187c">
<p>
Briefly, I've read a number of different ways to solve physics problems.
Back in the 1980s, there was a fascination with AI experts studying how
human experts solve problems. It turns out that Freedman and Young's
ISEE method is the basic approach that experts perform mostly
subconsciously:
</p>

<ol class="org-ol">
<li><b>Identify the relevant concepts.</b> Also identify the target variable
you're solving for. Write down the known and unknown quantities and
their values. You should be able to answer the question, "What is
being asked of me?"</li>
<li><b>Setup.</b> Write down the relevant equations from physical laws (like
\(F=ma\)). Do not solve or substitute numeric values. Pick a coordinate
system (if relevant). Draw diagrams (if relevant).</li>
<li><b>Execute.</b> "Do the math". As far as possible, do everything
symbolically, only substitute in numeric values at the last step.</li>
<li><b>Evaluate.</b> How do we know our answer is correct? This could involve
taking limits of the symbolic answer (e.g., when friction goes to
zero, or when it goes to infinity). Can we recover <i>previous</i> results
taking some appropriate limit? Perhaps we could do order-of-magnitude
estimates. Also dimensional analysis is useful.</li>
</ol>

<p>
Sometimes the "Identify" and "Setup" steps are contracted into one
"Identify and setup". When one gains expertise, the "identify" step
becomes "automatic".
</p>
</div>
</div>
</div>

<div id="outline-container-h-b10f11f4-db59-4585-abc4-1ea4a5feb224" class="outline-2">
<h2 id="h-b10f11f4-db59-4585-abc4-1ea4a5feb224"><span class="section-number-2">3.</span> References</h2>
<div class="outline-text-2" id="text-h-b10f11f4-db59-4585-abc4-1ea4a5feb224">
<ul class="org-ul">
<li>Atish Bagchi and Charles Wells,
"Varieties of Mathematical Prose".
Manuscript dated 1998, <a href="http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.8.7115&amp;rep=rep1&amp;type=pdf">PDF</a>.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-06-01 Tue 10:00.</p>
</div>
</body>
</html>